
# =====================================================
# =================== 部署参数 =========================
# =====================================================


# *****************************************************
# 设置为"yes"从而创建一个内核版镜像                       *
# *****************************************************
ONLY_BASE="no"


# *****************************************************
# 设定主机名，用户名以及ROOT和普通用户的密码                *
# *****************************************************
HOSTNAME="OrangePI"
USER="orangepi"
ROOTPASS="orangepi"
USERPASS="orangepi"


# *****************************************************
# 设置时区, 默认请(主机)设置 _timezone=""                  *
# *****************************************************
_timezone="Etc/UTC"
#_timezone=""


# *****************************************************
# 设定安装的语言,                                        *
# *****************************************************
LANGUAGE="zh_CN:en_US"
LANG="zh_CN.UTF-8"


# *****************************************************
# 设置镜像的基本名称                                     *
# 发行版名称会自动生成，镜像名称将会变成“镜像名-发行版.img”    *
# --------------------------------------------------- *
# 如果image_name="", 镜像将不会被创建,                   *
# 部署将会在本地目录进行：                                *
# linux-$distro & boot-$distro                        *
# 你能用以下命令创建镜像:                                 *
# sudo ./image_from_dir <directory> <DEVICE|IMAGE>    *
# ============== 推荐用这种方式来创建镜像 =============== *
# --------------------------------------------------- *
# 如果 image_name 是设备名 (/dev/sdXn)                  *
# Linux根文件系统将会创建到其中                            *
# 分区必须存在  !                                        *
# 如果 _format="" 磁盘将不会被格式化                     *
# 其他重要分区将会格式化成指定格式                         *
# *****************************************************
image_name=""
#image_name="minimal"
#image_name="/dev/sdg"


# *****************************************************
# Linux分区的文件系统格式                                *
# 如果你选择了 btrfs , 分区将会被挂载                     *
# "compressed" 选项, 节省一些SD卡的空间                  *
# --------------------------------------------------- *
# 直接部署系统在SD卡或用“image_from_dir”脚本创建SD卡镜像   *
# *****************************************************
_format="ext4"
#_format="btrfs"


# *****************************************************
# SD卡大小单位是 MB (1024 * 1024 bytes)                 *
# --------------------------------------------------- *
# 如果直接部署在SD卡 (不是镜像) 你能设置"linuxsize=0"来使用  *
# SD卡所有空间                                          *
# --------------------------------------------------- *
# 当使用 "image_from_dir" 脚本来创建镜像，根文件系统大小将按*
# 目录大小来创建。                                       *
# *****************************************************
fatsize=64
linuxsize=800


# *****************************************************
#   选择ubuntu或debian版本及安装镜像源地址                *
#   distro="xxx"是发行版本选项,repo=""是源地址            *
#    === 注意!只能有一个distro发行版本和repo源地址！ ===   *
# *****************************************************

# === Ubuntu ===
#distro="precise"
distro="trusty"
#distro="utopic"
#distro="vivid"
#distro="wily"
repo="http://ports.ubuntu.com/ubuntu-ports"

# === Debian ===
#distro="wheezy"
#distro="jessie"
#repo="http://ftp.hr.debian.org/debian"
#raspbian="no"

# === Raspbian ===
#distro="wheezy"
#distro="jessie"
#repo="http://archive.raspbian.org/raspbian"
#raspbian="yes"

# ******************************************************
# 如果是创建镜像, 你能用 XZ 压缩镜像，压缩之后创建 md5sum 文件 *
# 如果想自动做这一步, 设置  _compress="yes"                *
# ******************************************************
_compress="yes"


# =====================================================
# 如果你想在EXT4分区引导文件而不是在单独的FAT16分区          =
# 设定 _boot_on_ext4="yes" 以及FAT分区将不会创建          =
# --------------------------------------------------- =
# 现在不要改变它!                                       =
# =====================================================
_boot_on_ext4="no"


# ^^^^^^^^^^^^^^^^^^^^^ 部署参数 ^^^^^^^^^^^^^^^^^^^^^^^
# ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
